RubyOnRails/SMX/smx/app/controllers/homepage_controller.rb

SELECT "users".* FROM "users"
---
  def leaderboard
    @users = User.all

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
  def index
    @user = User.find(session[:user_id])

SELECT "users".* FROM "users"
---
  def real
    @users = User.all

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT "players".* FROM "players"
---
  def simgame
    @user1 = User.find(session[:user_id])
    @user2 = User.find(params[:id])
    @simgames = Simgame.new
    @players = Player.all

SELECT "users".* FROM "users"
---
  def sim
    @users = User.all

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT "players".* FROM "players"
SELECT  "simgames".* FROM "simgames" WHERE "simgames"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
SELECT  "players".* FROM "players" WHERE "players"."id" = ? LIMIT ?  [["id", 30], ["LIMIT", 1]]
SELECT  "players".* FROM "players" WHERE "players"."id" = ? LIMIT ?  [["id", 31], ["LIMIT", 1]]
SELECT  "players".* FROM "players" WHERE "players"."id" = ? LIMIT ?  [["id", 28], ["LIMIT", 1]]
SELECT  "players".* FROM "players" WHERE "players"."id" = ? LIMIT ?  [["id", 36], ["LIMIT", 1]]
SELECT  "players".* FROM "players" WHERE "players"."id" = ? LIMIT ?  [["id", 40], ["LIMIT", 1]]
SELECT COUNT(*) FROM "players"
INSERT INTO "players" ("full_name", "position", "sps", "shot_perc", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["full_name", "Kevin Durant"], ["position", "F"], ["sps", 15], ["shot_perc", 44], ["created_at", "2019-08-01 05:10:31.620588"], ["updated_at", "2019-08-01 05:10:31.620588"]]
---
  def result
    @u1 = 0
    @u2 = 0
    @p1_sps = []
    @p2_sps = []
    @p1_shot_perc = []
    @p2_shot_perc = []
    @p1 = [0,0,0,0,0]
    @p2 = [0,0,0,0,0]
    @user1 = User.find(session[:user_id])
    @user2 = User.find(params[:id])
    players = Player.all
    @p1_1 = Player.find(params["simgame"]["u1p1_id"])
    @p2_1 = Player.find(params["simgame"]["u1p2_id"])
    @p3_1 = Player.find(params["simgame"]["u1p3_id"])
    @p4_1 = Player.find(params["simgame"]["u1p4_id"])
    @p5_1 = Player.find(params["simgame"]["u1p5_id"])
    cpu_player_id = 1+rand(players.size)
    @p1_2 = players[cpu_player_id][:full_name]
    @p2_sps << players[cpu_player_id][:sps]