RubyOnRails/SMX/smx/app/controllers/user_controller.rb

  def profile
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]

  def create
    @user = User.new(user_params)
      if @user.valid?
        @user.save
---
INSERT INTO "users" ("full_name", "username", "team_name", "password_digest", "email", "amount", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)